Tekla Open API Reference for Tekla Structures 2025
ControlArc Constructor (Point, Point, Point)
 Creates a new control arc instance taking the 3 points.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ControlArc(
	Point startPoint,
	Point endPoint,
	Point pointOnArc
)
Public Sub New (
	startPoint As Point,
	endPoint As Point,
	pointOnArc As Point
)
Parameters
startPoint
Type: Tekla.Structures.Geometry3d.Point
Start point of the arc.
endPoint
Type: Tekla.Structures.Geometry3d.Point
End point of the arc.
pointOnArc
Type: Tekla.Structures.Geometry3d.Point
Point that defines the arc.
Exceptions
Exception | Condition
ArgumentException | Throws when input points are not defined correctly
See Also
Reference
ControlArc Class
ControlArc Overload
Tekla.Structures.Model Namespace